@echo off
echo ----------------------------------------------------
echo DiscordEEWBot用の拡張モジュールセットアップを行います。
echo Node.jsとNPMが使用できることを確認してください。
echo ----------------------------------------------------
echo NPMが使用できない場合はモジュールのダウンロードが出来ません。
echo 何かキーを押すとセットアップを開始します。
PAUSE
echo ----------------------------------------------------
echo 拡張モジュールをダウンロードします(1/1)
echo Download eris
echo ----------------------------------------------------
npm install eris
echo erisのダウンロードが完了しました。
echo ----------------------------------------------------
echo セットアップが完了しました。
echo 何かキーを押すと終了します。
echo ----------------------------------------------------